/*++
Copyright (c) 2006-2019 Byosoft Corporation. All rights reserved.
This software and associated documentation (if any) is furnished
under a license and may only be used or copied in accordance
with the terms of the license. Except as permitted by such
license, no part of this software or documentation may be
reproduced, stored in a retrieval system, or transmitted in any
form or by any means without the express written consent of
Byosoft Corporation.

Module Name:

Abstract:


--*/

/=#
#langdef   zh-Hans "\wide中文\narrow"
#langdef   en-US "English"

//
// BMC Configuration Setup Page
//
#string STR_BMC_NIC_CNFG_FORM_TITLE   #language en-US  "BMC Lan Configuration"
                                      #language zh-Hans "BMC\wide网络配置\narrow"
#string STR_BMC_NIC_CNFG_FORM_HELP    #language en-US  "View/Configure BMC Lan settings"
                                      #language zh-Hans "\wide查看\narrow/\wide配置\narrowBMC\wide网络设置\narrow"
#string STR_BMC_USER_CNFG_FORM_TITLE  #language en-US  "BMC User Configuration"
                                      #language zh-Hans "BMC\wide用户配置\narrow"
#string STR_BMC_USER_CNFG_FORM_HELP   #language en-US  "View/Configure BMC User settings"
                                      #language zh-Hans "\wide查看\narrow/\wide配置\narrowBMC\wide用户设置\narrow"
#string STR_BMC_USER_ADD_FORM_TITLE  #language en-US  "Add User"
                                      #language zh-Hans "\wide增加用户\narrow"
#string STR_BMC_USER_ADD_FORM_HELP   #language en-US  "Add a BMC User"
                                      #language zh-Hans "\wide增加一个\narrowBMC\wide用户\narrow"
#string STR_BMC_USER_DEL_FORM_TITLE  #language en-US  "Delete User"
                                      #language zh-Hans "\wide删除用户\narrow"
#string STR_BMC_USER_DEL_FORM_HELP   #language en-US  "Delete a BMC User"
                                      #language zh-Hans "\wide删除一个\narrowBMC\wide用户\narrow"

#string STR_PASSWORD_FAILED             #language en-US "Password cannot be the same as the previous password!"
                                        #language zh-Hans "\wide修改后的密码不能与前一次密码相同\narrow"
                                      
#string STR_BMC_USER_CHANGE_FORM_TITLE  #language en-US  "Change User"
                                      #language zh-Hans "\wide修改用户\narrow"
#string STR_BMC_USER_CHANGE_FORM_HELP   #language en-US  "Change a BMC User Settings"
                                      #language zh-Hans "\wide修改一个\narrowBMC\wide用户设置\narrow"
#string STR_IBMC_PORT_MODE            #language en-US  "NCSI & iBMC Mode"
                                      #language zh-Hans "NCSI & iBMC\wide模式\narrow"
#string STR_IBMC_PORT_MODE_HELP       #language en-US  "NCSI & iBMC Mode"
                                      #language zh-Hans "NCSI & iBMC Mode"
#string STR_DEDICATED_MODE            #language en-US  "Decicated"
                                      #language zh-Hans "\wide专用网卡\narrow"
#string STR_NCSI_MODE                 #language en-US  "NCSI"
                                      #language zh-Hans "\wide共享板载网卡\narrow"
#string STR_ADAPTIVE_MODE             #language en-US  "Adaptive"
                                      #language zh-Hans "\wide自适应\narrow"
#string STR_DUMMY_STRING              #language en-US  "------------------------------------------------------"
                                      #language zh-Hans "------------------------------------------------------"
#string STR_BASE_BOARD_NICCNFG        #language en-US  "Dedicated LAN configuration"
                                      #language zh-Hans "\wide专用局域网配置\narrow"
#string STR_NSCI_NICCNFG              #language en-US  "Shared LAN configuration"
                                      #language zh-Hans "\wide板载局域网配置\narrow"
#string STR_RMM_NICCNFG               #language en-US  "Dedicated Management LAN Configuration"
                                      #language zh-Hans "\wide专用管理局域网配置\narrow"
#string STR_RMM_NICIPV6CNFG           #language en-US  "Dedicated Management LAN IPv6 Configuration"
                                      #language zh-Hans "\wide专用管理网络\narrowIPv6 \wide配置\narrow"
#string STR_USER_CONFIGURATAION       #language en-US  "User Configuration"
                                      #language zh-Hans "\wide用户配置\narrow"
#string STR_USER_CONFIGURATAION_HELP  #language en-US  "View/Configure User information and settings of the BMC."
                                      #language zh-Hans "\wide查看\narrow/\wide配置用户信息和\narrow BMC\wide设置。\narrow"
#string STR_IPV4_MODE                 #language en-US  "IPv4 Source"
                                      #language zh-Hans "IPv4\wide地址模式\narrow"

#string STR_IPV4_MODE_HELP            #language en-US  "Select BMC IPv4 Source. If [Static], IP parameters may be edited. If [Dynamic], these fields are display-only and IP address is acquired automatically (DHCP)."
                                      #language zh-Hans "\wide选择\narrow BMC IPv4 \wide地址模式\narrow. \wide如果是静态，则可以编辑\narrow IPv4\wide参数，如果是动态，则这些字段仅显示，并自动获取\narrow IPv4\wide地址\narrow (DHCP)\wide。\narrow"
#string STR_IP_MODE_RMM4_HELP         #language en-US  "Select Dedicated Management LAN IP source. If [Static], IP parameters may be edited. If [Dynamic], these fields are display-only and IP address is acquired automatically (DHCP)."
                                      #language zh-Hans "\wide选择专用管理局域网\narrow IP Source.\wide如果是静态，则可以编辑\narrow IP\wide参数，如果是动态，则这些字段仅显示，并自动获取\narrow IP\wide地址\narrow (DHCP)\wide。\narrow"



#string STR_UNSPECIFIED                #language en-US  "Unspecified"
                                      #language zh-Hans "\wide未指定\narrow"
#string STR_STATIC_IP                 #language en-US  "Static"
                                      #language zh-Hans "\wide静态\narrow"
#string STR_DHCP_IP                   #language en-US  "Dynamic"
                                      #language zh-Hans "\wide动态\narrow"

#string STR_IPV4_ADDRESS_LABEL        #language en-US "IPv4 Address"
                                      #language zh-Hans "IPv4\wide地址\narrow"
#string STR_IPV4_ADDRESS_HELP         #language en-US "View/Edit IPv4 Address. Press <Enter> to edit."
                                      #language zh-Hans "\wide查看\narrow/\wide编辑\narrowIPv4\wide地址。按\narrow<Enter>\wide进行编辑。\narrow"

#string STR_SUBNET_MASK_LABEL         #language en-US "IPv4 Subnet Mask"
                                      #language zh-Hans "IPv4\wide子网掩码\narrow"
#string STR_SUBNET_MASK_HELP          #language en-US "View/Edit IPv4 Subnet Mask. Press <Enter> to edit."
                                      #language zh-Hans "\wide查看\narrow/\wide编辑\narrowIPv4\wide子网掩码。按\narrow<Enter>\wide进行编辑。\narrow"
#string STR_GATEWAY_IP_LABEL          #language en-US "IPv4 Gateway"
                                      #language zh-Hans "IPv4\wide默认网关\narrow"
#string STR_GATEWAY_IP_HELP           #language en-US "View/Edit IPv4 Gateway IP. Press <Enter> to edit."
                                      #language zh-Hans "\wide查看\narrow/\wide编辑\narrowIPv4\wide默认网关地址。按\narrow<Enter>\wide进行编辑。\narrow"
//
//IPV6 BIOS settings Strings
//
#string STR_IPV6_MODE                 #language en-US  "IPv6 Source"
                                      #language zh-Hans "IPv6\wide地址模式\narrow"
#string STR_IPV6_MODE_HELP            #language en-US  "Select BMC IPv6 Source. If [Static], IPv6 parameters may be edited. If [Dynamic], these fields are display-only and IPv6 address is acquired automatically (DHCP)."
                                      #language zh-Hans "\wide选择\narrow BMC IPv6 \wide地址模式\narrow. \wide如果是静态，则可以编辑\narrow IPv6\wide参数，如果是动态，则这些字段仅显示，并自动获取\narrow IPv6\wide地址\narrow (DHCP)\wide。\narrow"
#string STR_IPV6_MODE_RMM4_HELP       #language en-US  "Select DMN LAN IPv6 source. If [Static], IPv6 parameters may be edited. If [Dynamic], these fields are display-only and IPv6 address is acquired automatically (DHCP)."
                                      #language zh-Hans "\wide选择\narrow DMN LAN IPv6 source. \wide如果是静态，则可以编辑\narrow IPv6\wide参数，如果是动态，则这些字段仅显示，并自动获取\narrow IPv6\wide地址\narrow (DHCP)\wide。\narrow"
#string STR_STATIC_IPV6               #language en-US  "Static"
                                      #language zh-Hans "\wide静态\narrow"
#string STR_DHCP_IPV6                 #language en-US  "Dynamic"
                                      #language zh-Hans "\wide动态\narrow"
#string STR_AUTO_IPV6                 #language en-US  "Auto"
                                      #language zh-Hans "\wide自动\narrow"

#string STR_IPV6_ADDRESS_LABEL        #language en-US "IPv6 Address"
                                      #language zh-Hans "IPv6 \wide地址\narrow"
#string STR_IPV6_ADDRESS_HELP         #language en-US "View/Edit IPv6 address. Press <Enter> to edit. IPv6 addresses consist of 8 hexadecimal 4-digit numbers separated by colons."
                                      #language zh-Hans "\wide查看\narrow/\wide编辑\narrow IPv6\wide地址。按\narrow<Enter>\wide进行编辑。\narrow IPv6 \wide地址由以冒号分隔的\narrow 8\wide个十六进制\narrow 4\wide位数字组成。\narrow"
#string STR_IPV6_PREFIX_LENGTH_LABEL  #language en-US "IPv6 Prefix Length"
                                      #language zh-Hans "IPv6 \wide前缀长度\narrow"
#string STR_IPV6_PREFIX_LENGTH_HELP   #language en-US "View/Edit IPv6 Prefix Length from 0 to 128 (default 64). Press <Enter> to edit."
                                      #language zh-Hans "\wide查看\narrow/\wide编辑\narrowIPv6\wide前缀长度，范围为\narrow 0~128(\wide默认\narrow 64)\wide。按\narrow<Enter>\wide进行编辑。\narrow"
#string STR_GATEWAY_IPV6_LABEL        #language en-US "IPv6 Gateway"
                                      #language zh-Hans "IPv6\wide默认网关\narrow "
#string STR_GATEWAY_IPV6_HELP         #language en-US "View/Edit Gateway IPv6 address. Press <Enter> to edit. Gateway IPv6 addresses consist of 8 hexadecimal 4-digit numbers separated by colons."
                                      #language zh-Hans "\wide查看\narrow/\wide编辑\narrowIPv6\wide默认网关地址。按\narrow<Enter>\wide进行编辑。网关\narrow IPv6 \wide地址由以冒号分隔的\narrow 8\wide个十六进制\narrow 4\wide位数字组成。\narrow"
#string STR_IP_SELECTION              #language en-US  "IP mode"
                                      #language zh-Hans  "IP \wide模式\narrow"
#string STR_IP_SELECTION_HELP         #language en-US  "User to select IPV4,IPV6 IP mode"
                                      #language zh-Hans "\wide用户选择\narrow IPV4,IPV6 IP \wide模式\narrow"
#string STR_IPV6                      #language en-US  "IPv6"
                                      #language zh-Hans "IPv6"
#string STR_IPV6_HELP                 #language en-US  "Option to Enable/Disable IPv6 addressing and any IPv6 network traffic on these channels."
                                      #language zh-Hans "\wide启用\narrow/\wide禁用这些通道上的\narrowIPv6\wide寻址和任何\narrow IPv6\wide网络流量的选项\narrow"
#string STR_IPV4                      #language en-US  "IPV4"
                                      #language zh-Hans "IPV4"
#string STR_BASE_BOARD_NICIPV6CNFG    #language en-US  "Baseboard LAN IPv6 configuration"
                                      #language zh-Hans "\wide板载\narrow LAN IPv6 \wide配置\narrow"
#string STR_RMM4_STATUS_LABEL         #language en-US "Remote Management Module"
                                      #language zh-Hans "\wide远程管理模块\narrow"
#string STR_RMM4_STATUS_PRESENT       #language en-US "<Present>"
                                      #language zh-Hans "<Present>"
#string STR_RMM4_STATUS_NOT_PRESENT   #language en-US "<Not Present>"
                                      #language zh-Hans "<Not Present>"

#string STR_DHCP_NAME_LABEL           #language en-US "BMC DHCP Host Name"
                                      #language zh-Hans "BMC DHCP Host Name"

//According to RFC 952 DHCP host name len-USth ranges from 2 to 63 charecters. Since underscore (_) is not accepted by BMC as a valid DHCP host name charecter as it is against RFC952, it is removed.
#string STR_DHCP_NAME_HELP            #language en-US "View/Edit BMC DHCP host name. Press <Enter> to edit. Host name should start with an alphabetic, remaining can be alphanumeric characters. Host name length may be from 2 to 63 characters."
                                      #language zh-Hans "\wide查看\narrow/\wide编辑\narrow BMC DHCP host name. \wide按\narrow<\wide进入\narrow>\wide进行编辑。主机名应以字母开头，其余可以是字母数字字符。主机名可以是\narrow 2~63\wide个字符\narrow"
#string STR_BMC_USER_SELECT           #language en-US "User ID"
                                      #language zh-Hans "\wide用户\narrow ID"
#string STR_BMC_USER_SELECT_HELP      #language en-US "Select the User ID to configure: User1 (anonymous), User2 (admin), The Maximum Support up to 16 users."
                                      #language zh-Hans "\wide选择用户\narrow ID\wide进行配置：支持\narrow User1 (anonymous), User2 (admin), \wide最多支持\narrow16\wide个用户\narrow."

#string STR_USER_NAME_ANONYMOUS       #language en-US "anonymous"
                                      #language zh-Hans "anonymous"
#string STR_USER_NAME_ADMIN           #language en-US "admin"
                                      #language zh-Hans "admin"
#string STR_USER_RESV                 #language en-US "None"
                                      #language zh-Hans "None"
#string STR_USER1                     #language en-US "User1"
                                      #language zh-Hans "User1"
#string STR_USER2                     #language en-US "User2"
                                      #language zh-Hans "User2"
#string STR_USER3                     #language en-US "User3"
                                      #language zh-Hans "User3"
#string STR_USER4                     #language en-US "User4"
                                      #language zh-Hans "User4"
#string STR_USER5                     #language en-US "User5"
                                      #language zh-Hans "User5"
#string STR_USER6                     #language en-US "User6"
                                      #language zh-Hans "User6"
#string STR_USER7                     #language en-US "User7"
                                      #language zh-Hans "User7"
#string STR_USER8                     #language en-US "User8"
                                      #language zh-Hans "User8"
#string STR_USER9                     #language en-US "User9"
                                      #language zh-Hans "User9"
#string STR_USER10                     #language en-US "User10"
                                      #language zh-Hans "User10"
#string STR_USER11                     #language en-US "User11"
                                      #language zh-Hans "User11"
#string STR_USER12                     #language en-US "User12"
                                      #language zh-Hans "User12"
#string STR_USER13                     #language en-US "User13"
                                      #language zh-Hans "User13"
#string STR_USER14                     #language en-US "User14"
                                      #language zh-Hans "User14"
#string STR_USER15                     #language en-US "User15"
                                      #language zh-Hans "User15"
#string STR_USER16                     #language en-US "User16"
                                      #language zh-Hans "User16"
#string STR_USER2_NAME                #language en-US "admin"
                                      #language zh-Hans "admin"
#string STR_BMC_USER_PRIVILEGE_LABEL  #language en-US   "Privilege"
                                      #language zh-Hans "\wide用户权限\narrow"
#string STR_BMC_USER_PRIVILEGE_IP_HELP #language en-US   "View/Select user privilege."
                                       #language zh-Hans "\wide查看\narrow/\wide选择用户权限。\narrow"
#string STR_CALLBACK                   #language en-US   "Callback"
                                       #language zh-Hans "\wide回叫\narrow"
#string STR_USER                       #language en-US   "User"
                                       #language zh-Hans "\wide用户\narrow"
#string STR_OPERATOR                   #language en-US   "Operator"
                                       #language zh-Hans "\wide操作人\narrow"
#string STR_ADMINISTRATOR              #language en-US   "Administrator"
                                       #language zh-Hans "\wide管理员\narrow"
#string STR_NO_ACCESS                  #language en-US   "No Access"
                                       #language zh-Hans "\wide无法访问\narrow"

#string STR_USER_ENABLE_LABEL          #language en-US "User Status "
                                       #language zh-Hans "\wide用户状态\narrow"
#string STR_USER_ENABLE_HELP           #language en-US "Enable/Disable User Account."
                                       #language zh-Hans "\wide启用或禁用用户访问权限。\narrow"
#string STR_BMC_USER_NAME_LABEL        #language en-US "User Name"
                                       #language zh-Hans "\wide用户名称\narrow"
#string STR_BMC_USER_NAME_HELP         #language en-US "Press the < ENTER > key to enter the BMC user name. The length of the user name should be between 5-16 characters. The user name can contain uppercase letters, lowercase letters, numbers and underscores. And must start with a letter. \n"
                                       #language zh-Hans "\wide按\narrow<Enter>\wide键输入\narrowBMC\wide用户名，用户名长度应在\narrow5-16\wide个字符之间，用户名可以包含大写字母，小写字母，数字和下划线。且必须以字母开头。\narrow"
#string STR_BMC_USER_PASSWORD_PROMPT   #language en-US "User Password"
                                       #language zh-Hans "\wide用户密码\narrow"
#string STR_BMC_USER_PASSWORD_HELP     #language en-US "Press <Enter> key to enter password. Maximum length is 20 characters.\nWhen the BMC password complexity is turned off: \nthe password length is 2-20 characters; \nonly supports numbers, spaces and special characters ~!@#$%^&*()_+-=[]\{}|;':",./ <>?, case sensitive. \nWhen the BMC password complexity is enabled: \nthe password length is 8-20 characters; \nonly supports numbers, spaces and special characters ~!@#$%^&*()_+-=[]\{}|;':",./ <>?, case sensitive; \nContain at least two characters of uppercase letters, lowercase letters or numbers; \ncontain at least one space or special character; \ncannot be the same as the username and the username flashback.\n"
                                       #language zh-Hans "\wide按\narrow<Enter>\wide设置密码。最大支持是\narrow20\wide个字符。\narrow\nBMC\wide密码复杂度关闭时\narrow:\n ·\wide密码长度为\narrow2~20\wide字符\narrow;\n ·\wide仅支持字母\narrow,\wide数字\narrow,\wide空格和特殊字符\narrow~!@#$%^&*()_+-=[]\{}|;':",./<>?,\wide区分大小写。\narrow\nBMC\wide密码复杂度开启时\narrow:\n ·\wide密码长度为\narrow8~20\wide字符\narrow;\n ·\wide仅支持字母\narrow,\wide数字\narrow,\wide空格和特殊字符\narrow~!@#$%^&*()_+-=[]\{}|;':",./<>?,\wide区分大小写\narrow;\n ·\wide至少包含大写字母\narrow,\wide小写字母或数字中的两种字符;\narrow\n ·\wide至少包含一个空格或特殊字符\narrow;\n ·\wide不能与用户名以及用户名倒序相同。\narrow\n"
#string STR_NULL_STRING                #language en-US ""
                                       #language zh-Hans ""
#string STR_ENABLED                    #language en-US "Enabled"
                                       #language zh-Hans "\wide启用\narrow"
#string STR_DISABLED                   #language en-US "Disabled"
                                       #language zh-Hans "\wide禁用\narrow"
#string STR_DELETE                     #language en-US "Delete"
                                      #language zh-Hans "\wide删除\narrow"
#string STR_STANDARD_DEFAULT_PROMPT    #language en-US "Standard Default"
                                       #language zh-Hans "\wide标准默认\narrow"
#string STR_MANUFACTURE_DEFAULT_PROMPT #language en-US "Manufacture Default"
                                       #language zh-Hans "\wide生产厂商默认\narrow"
#string STR_SM_BMC_STATUS_PROMPT          #language en-US "BMC Self Test Status"
                                          #language zh-Hans "BMC\wide自检状态\narrow"
#string STR_SM_BMC_STATUS_VALUE            #language en-US "N/A"
#string STR_EMPTY                      #language en-US ""
                                       #language zh-Hans ""
#string STR_INVALID_IP                 #language en-US "Invalid IP Address."
                                       #language zh-Hans "\wide无效\narrowIP\wide地址。\narrow"
#string STR_ENTER_CORRECT_IP           #language en-US "Please Enter Correct IP address in form of "
                                       #language zh-Hans "\wide请输入如下正确的\narrowIP\wide地址形式：\narrow"
#string STR_ENTER_CONTINUE             #language en-US "Press ENTER to continue"
                                       #language zh-Hans "\wide按回车键继续\narrow"
#string STR_INVALID_SUBNET             #language en-US "Invalid Subnet Mask."
                                       #language zh-Hans "\wide无效子网掩码。\narrow"
#string STR_ENTER_CORRECT_SUBNET       #language en-US "Please Enter Correct Subnet address in form of "
                                       #language zh-Hans "\wide请输入如下正确的子网掩码地址形式：\narrow"
#string STR_INVALID_GATEWAY_IP         #language en-US "Invalid  Gateway IP Address."
                                       #language zh-Hans "\wide无效网关\narrowIP\wide地址。\narrow"
#string STR_ENTER_CORRECT_GATEWAY      #language en-US "Please Enter Correct Gateway IP address in form of "
                                       #language zh-Hans "\wide请输入如下正确的网关\narrowIP\wide地址形式：\narrow"
#string STR_ENTER_CORRECT_IPV          #language en-US "Please Enter Correct IP address in form of"
                                       #language zh-Hans "\wide请输入如下正确的\narrowIP\wide地址形式：\narrow"
#string STR_ENTER__GATEWAYIPV          #language en-US "Please Enter Correct Gateway IP address in form of"
                                       #language zh-Hans "\wide请输入如下正确的网关\narrowIP\wide地址形式：\narrow"
#string STR_IPV6_FORMAT                #language en-US "xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx"
                                       #language zh-Hans "xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx:xxxx"
#string STR_IPV4_FORMAT                #language en-US "xxx.xxx.xxx.xxx"
                                       #language zh-Hans "xxx.xxx.xxx.xxx"
#string STR_NAME_EXIST                 #language en-US "Username does not conform to specifications or already exists,Press ENTER to continue"
                                       #language zh-Hans "\wide用户名不符合规范或已存在，请输入符合要求的用户名，按回车键继续\narrow"
#string STR_INVALID_DHCP               #language en-US "Invalid DHCP host Name string. Please refer help text."
                                       #language zh-Hans "\wide无效的\narrowDHCP\wide主机名，请参阅帮助文本。\narrow"
#string STR_BMC_CORRECT_PD             #language en-US   "Passwords need to contain letters, numbers, and special symbols!"
                                       #language zh-Hans "\wide密码中需要包含字母、数字以及特殊符号！\narrow"
#string STR_BMC_VERSION_HELP            #language en-US ""
                                        #language zh-Hans ""
#string STR_BMC_VERSION                 #language en-US "BMC version"
                                        #language zh-Hans "BMC\wide版本\narrow"
#string STR_BMC_VERSION_VALUE           #language en-US "N\A"
                                        #language zh-Hans "N\A"
                                            
#string STR_BMC_SELF_INSPECTION_HELP    #language en-US "BMC self-inspection"
                                        #language zh-Hans "BMC\wide自检\narrow"
#string STR_BMC_SELF_INSPECTION         #language en-US "BMC self-inspection"
                                        #language zh-Hans "BMC\wide自检\narrow"

#string STR_BMC_RESTART_HELP            #language en-US "Restart BMC"
                                        #language zh-Hans "\wide重启\narrowBMC"
#string STR_BMC_RESTART                 #language en-US "Restart BMC"
                                        #language zh-Hans "\wide重启\narrowBMC"

#string STR_BMC_LOG_HELP                #language en-US ""
                                        #language zh-Hans ""
#string STR_BMC_LOG                     #language en-US "BMC Log
                                        #language zh-Hans "BMC\wide日志\narrow"
#string STR_WAIT_BMC_SEL                #language en-US "Please wait for getting logs from BMC."
                                        #language zh-Hans "BMC\wide日志收集中请等待\narrow."
#string STR_BMC_SELF_TEST_STATUS_PROMPT #language en-US "BMC Self Test Status"
                                        #language zh-Hans "BMC\wide自检状态\narrow"
#string STR_BMC_SELF_TEST_STATUS_VALUE  #language en-US "N/A"
                                           #language zh-Hans "N/A"
#string STR_BMC_FIRMWARE_REVISION_PROMPT        #language en-US "BMC Firmware Revision"
                                                #language zh-Hans "BMC Firmware\wide版本\narrow"
#string STR_BMC_FIRMWARE_REVISION_VALUE         #language en-US "N/A"
                                                #language zh-Hans "N/A"
#string STR_IPMI_REVISION_PROMPT        #language en-US "IPMI Version"
                                        #language zh-Hans "IPMI\wide版本\narrow"
#string STR_IPMI_REVISION_VALUE         #language en-US "N/A"
                                        #language zh-Hans "N/A"
#string STR_SET_SUCCESS                 #language en-US "Setting Successfully"
                                        #language zh-Hans "\wide设置成功\narrow"
#string STR_SET_FAILED                  #language en-US "Setting Failed"
                                        #language zh-Hans "\wide设置失败\narrow"
#string STR_USER_DELETE_FAILD           #language en-US "Account delete failed"
                                        #language zh-Hans "\wide用户删除失败\narrow"
#string STR_USER_DELETE_SUCCESS         #language en-US "Account delete Successfully"
                                        #language zh-Hans "\wide用户删除成功\narrow"
#string STR_SET_PASSWORD                #language en-US "Password Setting Successfully"
                                        #language zh-Hans "\wide密码设置成功\narrow"
#string STR_CLEAR_PD                    #language en-US "Password deleted succeeded"
                                        #language zh-Hans "\wide密码删除成功\narrow"
#string STR_ENTER_CORRECT_PD            #language en-US   "Invalid Password!please refer to password help message."
                                        #language zh-Hans "\wide无效的密码\narrow,\wide请参考帮助信息\narrow!"
#string STR_PASSWORD_TIMES              #language en-US   "Password has been used by the latest 5 times!"
                                        #language zh-Hans "\wide修改后的密码不能与前五次密码相同！\narrow"
#string STR_SET_USER_FIRST              #language en-US   "Please set user name first!"
                                        #language zh-Hans "\wide请先设置用户名！\narrow"
#string STR_NEED_SET_PASSWORD           #language en-US   "Please set this user password beore exit or save to exit Setup!"
                                        #language zh-Hans "Esc\wide或保存退出之前请继续设置该用户密码\narrow,\wide否则该用户不会生效\narrow!"
#string STR_DHCP_INVALID                #language en-US   "Invalid DHCP host Name string. Please refer help text"
                                        #language zh-Hans "\wide无效的\narrowDHCP\wide名\narrow,\wide请参考帮助信息！\narrow"

#string STR_ENTER_CORRECT_USERNAME      #language en-US   "Username only support the first character must be a letter,followed by letters, numbers," 
                                        #language zh-Hans "\wide 用户名仅支持首字符必须为字母，后面跟字母，数字,\narrow"
#string STR_ENTER_CORRECT_USERNAME1      #language en-US   "and special characters '_',and is Case sensitive" 
                                        #language zh-Hans "\wide以及特殊字符\narrow"_",\wide且区分大小写\narrow"
                                                            
#string STR_DELETE_USER_1               #language en-US "anonymous can't be deleted"
                                        #language zh-Hans "anonymous\wide不可删除\narrow"
                                        
#string STR_DELETE_USER_2               #language en-US "admin can't be deleted"
                                        #language zh-Hans "admin\wide不可删除\narrow"

#string STR_WRONG_PASSWORD              #language en-US "Wrong Password"
                                        #language zh-Hans "\wide密码错误\narrow"
#string STR_INVALID_USER                #language en-US "Invalid User"
                                        #language zh-Hans "\wide用户不存在\narrow"

#string STR_DELETE_USER_ACCOUNT         #language en-US "Input user's password"
                                        #language zh-Hans "\wide请输入该用户密码！\narrow"
                                        
#string STR_DELETE_USER_SUCCESS         #language en-US "Delete user success！"
                                        #language zh-Hans "\wide删除用户成功！\narrow"
#string STR_DELETE_USER_FAIL            #language en-US "Delete user faild"
                                        #language zh-Hans "\wide删除用户失败！\narrow"

#string STR_CHANGE_USER_PASSWORD        #language en-US "Change user Password"
                                        #language zh-Hans "\wide修改用户密码\narrow"

#string STR_BMC_NCSI                    #language en-US "NCSI"
                                        #language zh-Hans "\wide通用网口复用功能\narrow"
#string STR_BMC_NCSI_HELP               #language en-US "Select Enable/Disable NCSI"
                                        #language zh-Hans "\wide选择启用\narrow/\wide禁用通用网口复用功能\narrow"
#string STR_BMC_ADD_USER_PSWD_HELP      #language en-US "Press <Enter> to enter and verify User Password. Password complexity is determined by BMC."
                                       #language zh-Hans "\wide按\narrow<Enter>\wide来输入以及确认密码\narrow.\wide密码复杂度由\narrowBMC\wide决定\narrow."
#string STR_BMC_DEL_USER_PSWD_HELP      #language en-US "Press <Enter> to enter the user corresponding password. Successful password verification will delete the user."
                                       #language zh-Hans "\wide按\narrow<Enter>\wide来输入用户名对应密码，密码校验成功将会删除用户\narrow."
#string STR_BMC_CHANGE_USER_PSWD_HELP      #language en-US "Press < ENTER > to enter the password corresponding to the user name. After the password verification is successful, the [user password] changes to [modify user password], and the [user authority] and [user status] become changeable. User password complexity is determined by BMC."
                                       #language zh-Hans "\wide按\narrow<Enter>\wide来输入用户名对应密码，密码校验成功后，【用户密码】变为【修改用户密码】，同时【用户权限】和【用户状态】变为可更改。用户密码复杂度由\narrowBMC\wide决定\narrow."
									   
#string STR_BMC_CHANGE_USER_NAME_HELP      #language en-US "Press <Enter> to enter an existing user name for the BMC."
                                       #language zh-Hans "\wide按\narrow<Enter>\wide来输入已存在的\narrowBMC\wide用户名\narrow."